# St7GetAnimationCase

Returns the state assigned to the specified result case for multi-case animations.

long St7GetAnimationCase(long uID, long CaseNum, bool* Active)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Result case number.

Output Parameters

Active

True if the case is included in the animation.

General Model

General Model